app/Controllers/UserController.php

INSERT INTO `users` (`name`, `email`, `password`) VALUES ('PRUEBA', 'valeriomartinezmarco@gmail.com', '$2y$10$pTpHXb3Q/zfoWm7ZM7UsKexSWF3.tHwxujZLj/Oko9ULZ7WmMcZwO')
---
	public function create()
	{
		$inputs = $this->validate([
			'name' => 'required|min_length[5]',
			'email' => 'required|valid_email|is_unique[users.email]',
			'password' => 'required|min_length[5]'
		]);

		if (!$inputs) {
			return view('register', [
				'validation' => $this->validator
			]);
		}

		$this->user->save([
			'name' => $this->request->getVar('name'),
			'email'  => $this->request->getVar('email'),
			'password'  => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
		]);

SELECT *
FROM `users`
WHERE `email` = 'paucisnerosgl@gmail.com'
 LIMIT 1
---
	public function loginValidate()
	{
		$inputs = $this->validate([
			'email' => 'required|valid_email',
			'password' => 'required|min_length[5]'
		]);

		if (!$inputs) {
			return view('login', [
				'validation' => $this->validator
			]);
		}

		$email = $this->request->getVar('email');
		$password = $this->request->getVar('password');

		$user = $this->user->where('email', $email)->first();